/*==============================================================================

				   オブジェクト処理 [BENRIclass.cpp]
				Author : いでうら
				Date    : 2022/10/23(最終編集日)
------------------------------------------------------------------------------------------------------------------------------------------

==============================================================================*/
#include "BENRIclass.h"	
#include "player.h"
#include <DirectXMath.h>

//*****************************************************************************							
// マクロ定義							
//*****************************************************************************							

//*****************************************************************************							
// プロトタイプ宣言							
//*****************************************************************************							

//*****************************************************************************							
// グローバル変数							
//*****************************************************************************							

float AngleOf2Vector(D3DXVECTOR2 A, D3DXVECTOR2 B)
{
	//　※ベクトルの長さが0だと答えが出ませんので注意してください。

	//ベクトルAとBの長さを計算する
	float length_A = D3DXVec2Length(&A);
	float length_B = D3DXVec2Length(&B);

	//内積とベクトル長さを使ってcosθを求める
	float cos_sita = D3DXVec2Dot(&A, &B) / (length_A * length_B);

	//cosθからθを求める
	float sita = acosf(cos_sita);

	//ラジアンでなく0～180の角度でほしい場合はコメント外す
	sita = sita * 180.0 / DirectX::XM_PI;

	return sita;
}

int Float2_length_gather(int start,int goal)
{
	if (goal < start)
		goal += PLAYER_CURSOR_NUM;

	return (goal - start);
}