/*==============================================================================

   ゲーム本編処理 [game.cpp]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#include "game.h"
#include "texture.h"
#include "sprite.h"
#include "player.h"
#include "bg.h"
#include "collision.h"
#include "camera.h"
#include "object.h"
#include "stage.h"
#include "inputx.h"
#include "enemy.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitGame(void)
{
	// 頂点管理の初期化処理
	InitAkariObject();
	InitPlayer();
	InitEnemy();
	InitAtHanabi();

	// 背景の初期化
	InitBG();
	InitStage();

	InitCamera();

	

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitGame(void)
{
	UninitCamera();


	//背景の終了処理
	UninitBG();
	UninitStage();
	// 頂点管理の終了処理
	UninitPlayer();
	UninitEnemy();

	UninitAkariObject();

	UninitAtHanabi();
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateGame(void)
{

	// 頂点管理の更新処理
	UpdateAkariObject();
	UpdatePlayer();
	UpdateEnemy();
	UpdateAtHanabi();
	//背景の更新処理
	UpdateBG();
	UpdateStage();
	UpdateCamera();

	

}

//=============================================================================
// 描画処理
//=============================================================================
void DrawGame(void)
{
	//背景の描画処理
	DrawBG();
	DrawStage();
	// 頂点管理の描画処理
	DrawAkariObject();
	DrawPlayer();
	DrawEnemy();

	DrawAtHanabi();

	DrawCamera();

}
